perf/html-report/statistics.json
{
  "POST Login" : {
    "transaction" : "POST Login",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 204.04999999999993,
    "medianResTime" : 198.0,
    "minResTime" : 165.0,
    "maxResTime" : 375.0,
    "pct1ResTime" : 214.0,
    "pct2ResTime" : 228.95,
    "pct3ResTime" : 365.98,
    "throughput" : 16.65833749791771,
    "receivedKBytesPerSec" : 13.339684324504415,
    "sentKBytesPerSec" : 10.069834874229551
  },
  "GET Activity Log (page 1 size 50)" : {
    "transaction" : "GET Activity Log (page 1 size 50)",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 74.22999999999998,
    "medianResTime" : 73.0,
    "minResTime" : 68.0,
    "maxResTime" : 97.0,
    "pct1ResTime" : 81.0,
    "pct2ResTime" : 84.94999999999999,
    "pct3ResTime" : 95.96000000000004,
    "throughput" : 16.897600540723218,
    "receivedKBytesPerSec" : 162.2928723808719,
    "sentKBytesPerSec" : 9.05935810239946
  },
  "GET Batches (page 1 size 50)" : {
    "transaction" : "GET Batches (page 1 size 50)",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 74.015,
    "medianResTime" : 72.0,
    "minResTime" : 68.0,
    "maxResTime" : 97.0,
    "pct1ResTime" : 81.0,
    "pct2ResTime" : 83.89999999999998,
    "pct3ResTime" : 97.0,
    "throughput" : 16.88761293591151,
    "receivedKBytesPerSec" : 115.80548636325256,
    "sentKBytesPerSec" : 8.97154437220299
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 800,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 100.52374999999999,
    "medianResTime" : 73.0,
    "minResTime" : 45.0,
    "maxResTime" : 375.0,
    "pct1ResTime" : 201.0,
    "pct2ResTime" : 207.94999999999993,
    "pct3ResTime" : 336.97,
    "throughput" : 65.56839603311204,
    "receivedKBytesPerSec" : 287.1658829194328,
    "sentKBytesPerSec" : 35.96977194492255
  },
  "GET Dashboard Summary" : {
    "transaction" : "GET Dashboard Summary",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 49.800000000000026,
    "medianResTime" : 49.0,
    "minResTime" : 45.0,
    "maxResTime" : 63.0,
    "pct1ResTime" : 55.0,
    "pct2ResTime" : 57.94999999999999,
    "pct3ResTime" : 62.0,
    "throughput" : 16.91618032648228,
    "receivedKBytesPerSec" : 4.328163325721052,
    "sentKBytesPerSec" : 8.838043432292988
  }
}